Repository: allegro-systems/site
Catalog: Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ru

# error.message
source: The page you're looking for doesn't exist or has been moved.
de: Die gesuchte Seite existiert nicht oder wurde verschoben.
es: La página que buscas no existe o ha sido movida.
fr: La page que vous recherchez n'existe pas ou a été déplacée.
it: La pagina che stai cercando non esiste o è stata spostata.
ru: Страница, которую вы ищете, не существует или была перемещена.

# error.title
source: Page not found
de: Seite nicht gefunden
es: Página no encontrada
fr: Page non trouvée
it: Pagina non trovata
ru: Страница не найдена

# footer.copyright
source: © 2026 Allegro Systems. All rights reserved.
de: © 2026 Allegro Systems. Alle Rechte vorbehalten.
es: © 2026 Allegro Systems. Todos los derechos reservados.
fr: © 2026 Allegro Systems. Tous droits réservés.
it: © 2026 Allegro Systems. Tutti i diritti riservati.
ru: © 2026 Allegro Systems. Все права защищены.

# footer.tagline
source: Taking your ideas from score to stage.
de: Ihre Ideen von der Partitur auf die Bühne bringen.
es: Llevando tus ideas del concepto al escenario.
fr: De vos idées à la réalité.
it: Dalle tue idee alla realtà.
ru: Превращаем ваши идеи в реальность.

# home.docs
source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ru: Документация

# home.docs.composer
source: Composer Docs
de: Composer-Dokumentation
es: Documentación de Composer
fr: Documentation Composer
it: Documentazione Composer
ru: Документация Composer

# home.docs.composer.desc
source: Visual editor workflows, component library and export options.
de: Workflows des visuellen Editors, Komponentenbibliothek und Exportoptionen.
es: Flujos del editor visual, biblioteca de componentes y opciones de exportación.
fr: Workflows de l'éditeur visuel, bibliothèque de composants et options d'export.
it: Workflow dell'editor visuale, libreria componenti e opzioni di esportazione.
ru: Рабочие процессы визуального редактора, библиотека компонентов и опции экспорта.

# home.docs.score
source: Score Docs
de: Score-Dokumentation
es: Documentación de Score
fr: Documentation Score
it: Documentazione Score
ru: Документация Score

# home.docs.score.desc
source: Guides, API reference and tutorials for the Score framework.
de: Anleitungen, API-Referenz und Tutorials für das Score-Framework.
es: Guías, referencia de API y tutoriales para el framework Score.
fr: Guides, référence API et tutoriels pour le framework Score.
it: Guide, riferimento API e tutorial per il framework Score.
ru: Руководства, справочник API и учебные материалы по фреймворку Score.

# home.docs.stage
source: Stage Docs
de: Stage-Dokumentation
es: Documentación de Stage
fr: Documentation Stage
it: Documentazione Stage
ru: Документация Stage

# home.docs.stage.desc
source: Deployment guides, scaling configuration and observability setup.
de: Bereitstellungsanleitungen, Skalierungskonfiguration und Observability-Einrichtung.
es: Guías de despliegue, configuración de escalado y observabilidad.
fr: Guides de déploiement, configuration du scaling et mise en place de l'observabilité.
it: Guide al deployment, configurazione dello scaling e setup dell'osservabilità.
ru: Руководства по развёртыванию, настройке масштабирования и наблюдаемости.

# home.feature.integrated
source: Integrated by Design
de: Integriert durch Design
es: Integrado por Diseño
fr: Intégré par Design
it: Integrato per Design
ru: Интегрированный по дизайну

# home.feature.integrated.desc
source: Score, Stage, Composer, and Libretto work together as one cohesive system — no glue code required.
de: Score, Stage, Composer und Libretto arbeiten als ein zusammenhängendes System — kein Verbindungscode nötig.
es: Score, Stage, Composer y Libretto trabajan juntos como un sistema cohesivo — sin código de unión.
fr: Score, Stage, Composer et Libretto fonctionnent ensemble comme un système cohérent — aucun code de liaison nécessaire.
it: Score, Stage, Composer e Libretto lavorano insieme come un sistema coeso — nessun codice collante necessario.
ru: Score, Stage, Composer и Libretto работают вместе как единая система — без связующего кода.

# home.feature.open
source: Open and Transparent
de: Offen und Transparent
es: Abierto y Transparente
fr: Ouvert et Transparent
it: Aperto e Trasparente
ru: Открытый и прозрачный

# home.feature.open.desc
source: Open-source core with a commitment to developer freedom. Inspect, extend, and contribute.
de: Open-Source-Kern mit Engagement für Entwicklerfreiheit. Inspizieren, erweitern und beitragen.
es: Núcleo de código abierto con compromiso con la libertad del desarrollador. Inspecciona, extiende y contribuye.
fr: Noyau open-source avec un engagement pour la liberté des développeurs. Inspectez, étendez et contribuez.
it: Core open-source con un impegno per la libertà degli sviluppatori. Ispeziona, estendi e contribuisci.
ru: Открытый исходный код с приверженностью свободе разработчиков. Исследуйте, расширяйте и вносите вклад.

# home.feature.swift_first
source: Swift-First
de: Swift Zuerst
es: Swift Primero
ru: Swift в первую очередь

# home.feature.swift_first.desc
source: Built from the ground up in Swift. No wrappers, no compromises — just native performance and type safety.
de: Von Grund auf in Swift gebaut. Keine Wrapper, keine Kompromisse — native Leistung und Typsicherheit.
es: Construido desde cero en Swift. Sin envoltorios, sin compromisos — rendimiento nativo y seguridad de tipos.
fr: Construit de zéro en Swift. Pas de wrappers, pas de compromis — juste des performances natives et la sûreté des types.
it: Costruito da zero in Swift. Nessun wrapper, nessun compromesso — solo prestazioni native e sicurezza dei tipi.
ru: Построен с нуля на Swift. Без обёрток, без компромиссов — нативная производительность и безопасность типов.

# home.hero.subtitle
source: A Swift-first ecosystem of tools for building, hosting, and publishing on the modern web.
de: Ein Swift-natives Ökosystem von Werkzeugen zum Erstellen, Hosten und Veröffentlichen im modernen Web.
es: Un ecosistema Swift de herramientas para construir, alojar y publicar en la web moderna.
fr: Un écosystème Swift-first d'outils pour construire, héberger et publier sur le web moderne.
it: Un ecosistema Swift-first di strumenti per costruire, ospitare e pubblicare sul web moderno.
ru: Экосистема инструментов на Swift для создания, хостинга и публикации в современном вебе.

# home.hero.title
source: Taking your ideas from score to stage
de: Ihre Ideen von der Partitur auf die Bühne
es: Llevando tus ideas del concepto al escenario
fr: De vos idées à la réalité
it: Dalle tue idee alla realtà
ru: Превращаем ваши идеи в реальность

# home.products
source: Products
de: Produkte
es: Productos
fr: Produits
it: Prodotti
ru: Продукты

# home.why_allegro
source: Why Allegro
de: Warum Allegro
es: Por qué Allegro
fr: Pourquoi Allegro
it: Perché Allegro
ru: Почему Allegro

# libretto.capabilities
source: Rich Text Editor · Developer-Focused · Built-In Discovery
de: Rich-Text-Editor · Entwickler-fokussiert · Integrierte Entdeckung
es: Editor de Texto Enriquecido · Enfocado en Desarrolladores · Descubrimiento Integrado
fr: Éditeur Rich Text · Pour développeurs · Découverte intégrée
it: Editor Rich Text · Per sviluppatori · Discovery integrata
ru: Редактор форматированного текста · Для разработчиков · Встроенное обнаружение

# libretto.description
source: A blogging platform built for developers and technical writers — powered by Score and Stage. A rich editing experience, distraction-free, and designed to let your ideas reach the right people. Coming soon.
de: Eine Blogging-Plattform für Entwickler und technische Autoren — angetrieben von Score und Stage. Ein reichhaltiges Bearbeitungserlebnis, ablenkungsfrei, und darauf ausgelegt, Ihre Ideen zu den richtigen Menschen zu bringen. Demnächst.
es: Una plataforma de blogs para desarrolladores y escritores técnicos — impulsada por Score y Stage. Una experiencia de edición enriquecida, sin distracciones, diseñada para que tus ideas lleguen a las personas adecuadas. Próximamente.
fr: Une plateforme de blogging pour les développeurs et rédacteurs techniques — propulsée par Score et Stage. Une expérience d'édition riche, sans distraction, conçue pour que vos idées atteignent les bonnes personnes. Bientôt disponible.
it: Una piattaforma di blogging per sviluppatori e scrittori tecnici — powered by Score e Stage. Un'esperienza di editing ricca, senza distrazioni, progettata per far arrivare le tue idee alle persone giuste. In arrivo.
ru: Платформа для блогов, созданная для разработчиков и технических писателей — на базе Score и Stage. Богатый опыт редактирования, без отвлечений, спроектирован, чтобы ваши идеи дошли до нужных людей. Скоро.

# libretto.feature.analytics
source: Audience Analytics
de: Publikumsanalysen
es: Análisis de Audiencia
fr: Analytique d'Audience
it: Analisi del Pubblico
ru: Аналитика аудитории

# libretto.feature.analytics.desc
source: Understand who reads your work with built-in stats on views, reads, and engagement.
de: Verstehen Sie, wer Ihre Arbeit liest, mit integrierten Statistiken zu Aufrufen, Lese-Dauer und Engagement.
es: Comprende quién lee tu trabajo con estadísticas integradas de vistas, lecturas e interacción.
fr: Comprenez qui lit votre travail grâce aux statistiques intégrées de vues, lectures et engagement.
it: Scopri chi legge il tuo lavoro con statistiche integrate su visualizzazioni, letture e coinvolgimento.
ru: Понимайте, кто читает ваши работы, с помощью встроенной статистики просмотров, прочтений и вовлечённости.

# libretto.feature.discovery
source: Discovery Feed
de: Entdeckungs-Feed
es: Feed de Descubrimiento
fr: Fil de Découverte
it: Feed di Scoperta
ru: Лента обнаружения

# libretto.feature.discovery.desc
source: Follow writers, curate reading lists, and surface posts through tags and recommendations.
de: Autoren folgen, Leselisten kuratieren und Beiträge durch Tags und Empfehlungen hervorheben.
es: Sigue escritores, cura listas de lectura y muestra publicaciones a través de etiquetas y recomendaciones.
fr: Suivez des auteurs, créez des listes de lecture et découvrez des articles via les tags et recommandations.
it: Segui gli scrittori, cura liste di lettura e scopri post tramite tag e raccomandazioni.
ru: Подписывайтесь на авторов, составляйте списки чтения и находите публикации через теги и рекомендации.

# libretto.feature.editor.desc
source: A block-based editor with rich formatting, media embeds, and optional Markdown mode for when you want it.
de: Ein blockbasierter Editor mit reichhaltiger Formatierung, Media-Embeds und optionalem Markdown-Modus.
es: Un editor basado en bloques con formato enriquecido, contenido multimedia incrustado y modo Markdown opcional.
fr: Un éditeur par blocs avec mise en forme riche, intégration de médias et mode Markdown optionnel.
it: Un editor a blocchi con formattazione ricca, embed multimediali e modalità Markdown opzionale.
ru: Блочный редактор с богатым форматированием, встраиванием медиа и опциональным режимом Markdown.

# libretto.headline
source: A Platform for Writers
de: Eine Plattform für Autoren
es: Una Plataforma para Escritores
fr: Une Plateforme pour les Auteurs
it: Una Piattaforma per Scrittori
ru: Платформа для писателей

# libretto.meta_desc
source: Write, publish, and grow your audience
de: Schreiben, veröffentlichen und Ihre Leserschaft aufbauen
es: Escribe, publica y haz crecer tu audiencia
fr: Écrivez, publiez et développez votre audience
it: Scrivi, pubblica e fai crescere il tuo pubblico
ru: Пишите, публикуйте и расширяйте свою аудиторию

# nav.about
source: About
de: Über uns
es: Nosotros
fr: À Propos
it: Chi Siamo
ru: О нас

# nav.docs
source: Docs
de: Dokumentation
es: Documentación
ru: Документация

# nav.docs.composer.desc
source: Visual editor workflows and component library
de: Workflows des visuellen Editors und Komponentenbibliothek
es: Flujos del editor visual y biblioteca de componentes
fr: Workflows de l'éditeur visuel et bibliothèque de composants
it: Workflow dell'editor visuale e libreria componenti
ru: Рабочие процессы визуального редактора и библиотека компонентов

# nav.docs.score.desc
source: Guides, API reference and tutorials
de: Anleitungen, API-Referenz und Tutorials
es: Guías, referencia de API y tutoriales
fr: Guides, référence API et tutoriels
it: Guide, riferimento API e tutorial
ru: Руководства, справочник API и учебные материалы

# nav.docs.stage.desc
source: Deployment guides and scaling configuration
de: Bereitstellungsanleitungen und Skalierungskonfiguration
es: Guías de despliegue y configuración de escalado
fr: Guides de déploiement et configuration du scaling
it: Guide al deployment e configurazione dello scaling
ru: Руководства по развёртыванию и настройке масштабирования

# nav.documentation
source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ru: Документация

# nav.products
source: Products
de: Produkte
es: Productos
fr: Produits
it: Prodotti
ru: Продукты

# nav.products.composer.desc
source: Native macOS & iPad visual editor for Score UIs
de: Nativer visueller Editor für macOS und iPad für Score-UIs
es: Editor visual nativo para macOS e iPad para interfaces Score
fr: Éditeur visuel natif macOS et iPad pour les UI Score
it: Editor visuale nativo per macOS e iPad per le UI di Score
ru: Нативный визуальный редактор для macOS и iPad для Score UI

# nav.products.libretto.desc
source: Reference app built entirely on Score and Stage
de: Referenz-App, vollständig auf Score und Stage aufgebaut
es: Aplicación de referencia construida enteramente con Score y Stage
fr: Application de référence entièrement construite sur Score et Stage
it: App di riferimento costruita interamente su Score e Stage
ru: Эталонное приложение, полностью построенное на Score и Stage

# nav.products.score.desc
source: Swift web framework for components, HTML, CSS & JS
de: Swift-Web-Framework für Komponenten, HTML, CSS & JS
es: Framework web en Swift para componentes, HTML, CSS y JS
fr: Framework web Swift pour composants, HTML, CSS et JS
it: Framework web Swift per componenti, HTML, CSS e JS
ru: Swift веб-фреймворк для компонентов, HTML, CSS и JS

# nav.products.stage.desc
source: Deploy, scale and observe Score applications
de: Score-Anwendungen bereitstellen, skalieren und überwachen
es: Despliega, escala y observa aplicaciones Score
fr: Déployez, scalez et observez les applications Score
it: Deploy, scala e monitora le applicazioni Score
ru: Развёртывание, масштабирование и мониторинг приложений Score

# products.composer.card_desc
source: The native macOS and iPad visual editor. Build Score UIs without touching the compiler.
de: Der native visuelle Editor für macOS und iPad. Score-UIs erstellen ohne den Compiler zu berühren.
es: El editor visual nativo para macOS e iPad. Construye interfaces Score sin tocar el compilador.
fr: L'éditeur visuel natif pour macOS et iPad. Construisez des UI Score sans toucher au compilateur.
it: L'editor visuale nativo per macOS e iPad. Costruisci UI Score senza toccare il compilatore.
ru: Нативный визуальный редактор для macOS и iPad. Создавайте Score UI без компилятора.

# products.libretto.card_desc
source: The first-party reference application. A proof-of-concept built entirely on Score and Stage.
de: Die Referenzanwendung. Ein Proof-of-Concept, vollständig auf Score und Stage aufgebaut.
es: La aplicación de referencia. Una prueba de concepto construida enteramente con Score y Stage.
fr: L'application de référence. Un proof-of-concept entièrement construit sur Score et Stage.
it: L'applicazione di riferimento. Un proof-of-concept costruito interamente su Score e Stage.
ru: Эталонное приложение. Proof-of-concept, полностью построенный на Score и Stage.

# products.score.card_desc
source: The Swift web framework. Write components, compile to HTML, CSS and JS.
de: Das Swift-Web-Framework. Komponenten schreiben, zu HTML, CSS und JS kompilieren.
es: El framework web en Swift. Escribe componentes, compila a HTML, CSS y JS.
fr: Le framework web Swift. Écrivez des composants, compilez en HTML, CSS et JS.
it: Il framework web Swift. Scrivi componenti, compila in HTML, CSS e JS.
ru: Swift веб-фреймворк. Пишите компоненты, компилируйте в HTML, CSS и JS.

# products.stage.card_desc
source: The hosting and operations layer. Deploy, scale and observe Score applications.
de: Die Hosting- und Betriebsschicht. Score-Anwendungen bereitstellen, skalieren und überwachen.
es: La capa de alojamiento y operaciones. Despliega, escala y observa aplicaciones Score.
fr: La couche d'hébergement et d'opérations. Déployez, scalez et observez les applications Score.
it: Il livello di hosting e operazioni. Deploy, scala e monitora le applicazioni Score.
ru: Слой хостинга и операций. Развёртывайте, масштабируйте и мониторьте приложения Score.

# products.subtitle
source: A vertically integrated ecosystem of tools for the modern web — from framework to deployment.
de: Ein vertikal integriertes Ökosystem von Werkzeugen für das moderne Web — vom Framework bis zur Bereitstellung.
es: Un ecosistema verticalmente integrado de herramientas para la web moderna — del framework al despliegue.
fr: Un écosystème verticalement intégré d'outils pour le web moderne — du framework au déploiement.
it: Un ecosistema verticalmente integrato di strumenti per il web moderno — dal framework al deployment.
ru: Вертикально интегрированная экосистема инструментов для современного веба — от фреймворка до развёртывания.

# products.title
source: Products
de: Produkte
es: Productos
fr: Produits
it: Prodotti
ru: Продукты

# score.feature.auth
source: Auth Out of the Box
de: Authentifizierung Inklusive
es: Autenticación Incluida
fr: Authentification Prête à l'Emploi
it: Autenticazione Pronta all'Uso
ru: Аутентификация из коробки

# score.feature.auth.desc
source: Add login, sessions, and route guards with a few lines. Vendor integrations handle the provider details.
de: Login, Sessions und Route-Guards mit wenigen Zeilen hinzufügen. Anbieter-Integrationen kümmern sich um die Details.
es: Añade inicio de sesión, sesiones y protecciones de ruta con pocas líneas. Las integraciones manejan los detalles del proveedor.
fr: Ajoutez login, sessions et protection des routes en quelques lignes. Les intégrations gèrent les détails du fournisseur.
it: Aggiungi login, sessioni e protezione delle route con poche righe. Le integrazioni gestiscono i dettagli del provider.
ru: Добавьте логин, сессии и защиту маршрутов в несколько строк. Интеграции с провайдерами берут на себя детали.

# score.feature.deploy
source: Ship as Static or Server
de: Als Statisch oder Server ausliefern
es: Publica como Estático o Servidor
fr: Publiez en Statique ou Serveur
it: Pubblica come Statico o Server
ru: Статика или сервер

# score.feature.deploy.desc
source: Generate a static site or run a live server from the same codebase. One command either way.
de: Eine statische Website generieren oder einen Live-Server aus derselben Codebasis betreiben. Ein Befehl in jedem Fall.
es: Genera un sitio estático o ejecuta un servidor en vivo desde la misma base de código. Un comando en cualquier caso.
fr: Générez un site statique ou lancez un serveur live depuis la même base de code. Une seule commande dans les deux cas.
it: Genera un sito statico o esegui un server live dalla stessa codebase. Un solo comando in entrambi i casi.
ru: Генерируйте статический сайт или запускайте живой сервер из одной кодовой базы. Одна команда в любом случае.

# score.feature.pages
source: Write Pages in Swift
de: Seiten in Swift schreiben
es: Escribe Páginas en Swift
fr: Écrivez des Pages en Swift
it: Scrivi Pagine in Swift
ru: Пишите страницы на Swift

# score.feature.pages.desc
source: Define layouts, components, and content with Swift result builders. No templates or string wrangling.
de: Layouts, Komponenten und Inhalte mit Swift Result-Buildern definieren. Keine Templates oder String-Manipulation.
es: Define maquetaciones, componentes y contenido con result builders de Swift. Sin plantillas ni manipulación de cadenas.
fr: Définissez layouts, composants et contenus avec les result builders Swift. Pas de templates ni de manipulation de chaînes.
it: Definisci layout, componenti e contenuti con i result builder di Swift. Nessun template o manipolazione di stringhe.
ru: Определяйте макеты, компоненты и контент с помощью Swift result builders. Никаких шаблонов и манипуляций со строками.

# score.feature.persistence
source: Built-in Persistence
de: Integrierte Persistenz
es: Persistencia Integrada
fr: Persistance Intégrée
it: Persistenza Integrata
ru: Встроенная персистентность

# score.feature.persistence.desc
source: Store and query data without bolting on an ORM. Entities, migrations, and queries are part of the framework.
de: Daten speichern und abfragen ohne externes ORM. Entitäten, Migrationen und Abfragen sind Teil des Frameworks.
es: Almacena y consulta datos sin necesidad de un ORM externo. Entidades, migraciones y consultas son parte del framework.
fr: Stockez et interrogez des données sans ajouter d'ORM. Entités, migrations et requêtes font partie du framework.
it: Memorizza e interroga dati senza aggiungere un ORM. Entità, migrazioni e query fanno parte del framework.
ru: Храните и запрашивайте данные без подключения ORM. Сущности, миграции и запросы — часть фреймворка.

# score.feature.reactive
source: Reactive UI
de: Reaktive UI
es: Interfaz Reactiva
fr: UI Réactive
it: UI Reattiva
ru: Реактивный UI

# score.feature.reactive.desc
source: Add interactive elements with signals. State changes update the page instantly, no full reload needed.
de: Interaktive Elemente mit Signalen hinzufügen. State-Änderungen aktualisieren die Seite sofort, kein vollständiger Reload nötig.
es: Añade elementos interactivos con señales. Los cambios de estado actualizan la página al instante, sin recarga completa.
fr: Ajoutez des éléments interactifs avec les signaux. Les changements d'état mettent à jour la page instantanément, sans rechargement complet.
it: Aggiungi elementi interattivi con i segnali. I cambiamenti di stato aggiornano la pagina istantaneamente, senza ricaricamento completo.
ru: Добавляйте интерактивные элементы с помощью сигналов. Изменения состояния обновляют страницу мгновенно, без полной перезагрузки.

# score.feature.theme
source: Themeable by Default
de: Standardmäßig Thematisierbar
es: Tematizable por Defecto
fr: Thèmes par Défaut
it: Temi di Default
ru: Темизация по умолчанию

# score.feature.theme.desc
source: Set colours, fonts, spacing, and dark mode once. Every component picks them up automatically.
de: Farben, Schriften, Abstände und Dark Mode einmal einstellen. Jede Komponente übernimmt sie automatisch.
es: Configura colores, fuentes, espaciado y modo oscuro una vez. Cada componente los recoge automáticamente.
fr: Définissez couleurs, polices, espacement et mode sombre une fois. Chaque composant les adopte automatiquement.
it: Imposta colori, font, spaziatura e modalità scura una volta. Ogni componente li adotta automaticamente.
ru: Задайте цвета, шрифты, отступы и тёмный режим один раз. Все компоненты подхватят их автоматически.

# score.hero.docs
source: Read the Docs →
de: Dokumentation lesen →
es: Leer Documentación →
fr: Lire la documentation →
it: Leggi la documentazione →
ru: Читать документацию →

# score.hero.github
source: View on GitHub →
de: Auf GitHub ansehen →
es: Ver en GitHub →
fr: Voir sur GitHub →
it: Vedi su GitHub →
ru: Смотреть на GitHub →
